tutorials/porousMediaFluid/packedBedHeating/0/T.MCH
FoamFile {
    format ascii;
    class volScalarField;
    object T.MCH;
}

dimensions [temperature];

internalField uniform 273.15 [K];

boundaryField {
    "(inlet|outlet)" {
        type zeroGradient;
    }

    walls {
        type fixedValue;
        value uniform 373.15 [K];
    }
}