tutorials/porousMediaFluid/packedBedHeating/0/U
FoamFile {
    format ascii;
    class volVectorField;
    object U;
}

dimensions [velocity];

internalField uniform (0 0 0.2);

boundaryField {
    inlet {
        type fixedValue;
        value $internalField;
    }
    walls {
        type noSlip;
    }
    outlet {
        type zeroGradient;
    }
}