tutorials/porousMediaFluid/packedBedHeating/0/alpha.catA.orig
FoamFile {
    format ascii;
    class volScalarField;
    object alpha.porous;
}

dimensions [0 0 0 0 0 0 0];

internalField uniform 0;

boundaryField {
    "(inlet|outlet|walls)" {
        type zeroGradient;
    }
}

