tutorials/porousMediaFluid/packedBedHeating/0/p
FoamFile {
    format ascii;
    class volScalarField;
    object p;
}

dimensions [pressure];

internalField   uniform 0;

boundaryField {
    inlet {
        type zeroGradient;
    }
    outlet {
        type fixedValue;
        value $internalField;
    }
    walls {
        type zeroGradient;
    }
}