tutorials/porousMediaFluid/packedBedHeating/constant/phaseProperties
FoamFile {
    class dictionary;
    format ascii;
    object phaseProperties;
}

porousPhases (
    inert
    catA
    H2
    MCH 
    TOL
    Al2O3
    ZrO2
    Pt
);

heatTransfer {
    "inert:fluid" {
        type equilibrium;
    }

    "catA:H2" {
        type equilibrium;
    }
    "H2:MCH" {
        type equilibrium;
    }

    "MCH:TOL" {
        type equilibrium;
    }
    "Al2O3:ZrO2" {
        type equilibrium;
    }
    "ZrO2:Pt" {
        type equilibrium;
    }

    "fluid:catA" {
        type nonEquilibrium;
        heatTransferCoeff 40[W/m^2/K];
        specificSurfaceArea  1e3[m^2/m^3];
    }
    "fluid:Al2O3" {
        type nonEquilibrium;
        heatTransferCoeff 40[W/m^2/K];
        specificSurfaceArea  2e3[m^2/m^3];
    }
}

effectiveHeatConductivity {
    default {
        type parallel;
    }
    // "fluid:inert:catA" {
    //     type parallel;
    // }
}